grevaillot/svd_tools/headers/STM32F105xx/can1.h
#pragma once 

/* --- CAN1: Controller area network -------------------------------- */

/** @defgroup can1_registers Controller area network Register
@{*/

/** CAN1_CAN_MCR CAN_MCR **/
#define CAN1_CAN_MCR			MMIO32(CAN1_BASE + 0x00)
/** CAN1_CAN_MSR CAN_MSR **/
#define CAN1_CAN_MSR			MMIO32(CAN1_BASE + 0x04)
/** CAN1_CAN_TSR CAN_TSR **/
#define CAN1_CAN_TSR			MMIO32(CAN1_BASE + 0x08)
/** CAN1_CAN_RF0R CAN_RF0R **/
#define CAN1_CAN_RF0R			MMIO32(CAN1_BASE + 0x0c)
/** CAN1_CAN_RF1R CAN_RF1R **/
#define CAN1_CAN_RF1R			MMIO32(CAN1_BASE + 0x10)
/** CAN1_CAN_IER CAN_IER **/
#define CAN1_CAN_IER			MMIO32(CAN1_BASE + 0x14)
/** CAN1_CAN_ESR CAN_ESR **/
#define CAN1_CAN_ESR			MMIO32(CAN1_BASE + 0x18)
/** CAN1_CAN_BTR CAN_BTR **/
#define CAN1_CAN_BTR			MMIO32(CAN1_BASE + 0x1c)
/** CAN1_CAN_TI0R CAN_TI0R **/
#define CAN1_CAN_TI0R			MMIO32(CAN1_BASE + 0x180)
/** CAN1_CAN_TDT0R CAN_TDT0R **/
#define CAN1_CAN_TDT0R			MMIO32(CAN1_BASE + 0x184)
/** CAN1_CAN_TDL0R CAN_TDL0R **/
#define CAN1_CAN_TDL0R			MMIO32(CAN1_BASE + 0x188)
/** CAN1_CAN_TDH0R CAN_TDH0R **/
#define CAN1_CAN_TDH0R			MMIO32(CAN1_BASE + 0x18c)
/** CAN1_CAN_TI1R CAN_TI1R **/
#define CAN1_CAN_TI1R			MMIO32(CAN1_BASE + 0x190)
/** CAN1_CAN_TDT1R CAN_TDT1R **/
#define CAN1_CAN_TDT1R			MMIO32(CAN1_BASE + 0x194)
/** CAN1_CAN_TDL1R CAN_TDL1R **/
#define CAN1_CAN_TDL1R			MMIO32(CAN1_BASE + 0x198)
/** CAN1_CAN_TDH1R CAN_TDH1R **/
#define CAN1_CAN_TDH1R			MMIO32(CAN1_BASE + 0x19c)
/** CAN1_CAN_TI2R CAN_TI2R **/
#define CAN1_CAN_TI2R			MMIO32(CAN1_BASE + 0x1a0)
/** CAN1_CAN_TDT2R CAN_TDT2R **/
#define CAN1_CAN_TDT2R			MMIO32(CAN1_BASE + 0x1a4)
/** CAN1_CAN_TDL2R CAN_TDL2R **/
#define CAN1_CAN_TDL2R			MMIO32(CAN1_BASE + 0x1a8)
/** CAN1_CAN_TDH2R CAN_TDH2R **/
#define CAN1_CAN_TDH2R			MMIO32(CAN1_BASE + 0x1ac)
/** CAN1_CAN_RI0R CAN_RI0R **/
#define CAN1_CAN_RI0R			MMIO32(CAN1_BASE + 0x1b0)
/** CAN1_CAN_RDT0R CAN_RDT0R **/
#define CAN1_CAN_RDT0R			MMIO32(CAN1_BASE + 0x1b4)
/** CAN1_CAN_RDL0R CAN_RDL0R **/
#define CAN1_CAN_RDL0R			MMIO32(CAN1_BASE + 0x1b8)
/** CAN1_CAN_RDH0R CAN_RDH0R **/
#define CAN1_CAN_RDH0R			MMIO32(CAN1_BASE + 0x1bc)
/** CAN1_CAN_RI1R CAN_RI1R **/
#define CAN1_CAN_RI1R			MMIO32(CAN1_BASE + 0x1c0)
/** CAN1_CAN_RDT1R CAN_RDT1R **/
#define CAN1_CAN_RDT1R			MMIO32(CAN1_BASE + 0x1c4)
/** CAN1_CAN_RDL1R CAN_RDL1R **/
#define CAN1_CAN_RDL1R			MMIO32(CAN1_BASE + 0x1c8)
/** CAN1_CAN_RDH1R CAN_RDH1R **/
#define CAN1_CAN_RDH1R			MMIO32(CAN1_BASE + 0x1cc)
/** CAN1_CAN_FMR CAN_FMR **/
#define CAN1_CAN_FMR			MMIO32(CAN1_BASE + 0x200)
/** CAN1_CAN_FM1R CAN_FM1R **/
#define CAN1_CAN_FM1R			MMIO32(CAN1_BASE + 0x204)
/** CAN1_CAN_FS1R CAN_FS1R **/
#define CAN1_CAN_FS1R			MMIO32(CAN1_BASE + 0x20c)
/** CAN1_CAN_FFA1R CAN_FFA1R **/
#define CAN1_CAN_FFA1R			MMIO32(CAN1_BASE + 0x214)
/** CAN1_CAN_FA1R CAN_FA1R **/
#define CAN1_CAN_FA1R			MMIO32(CAN1_BASE + 0x21c)
/** CAN1_F0R1 Filter bank 0 register 1 **/
#define CAN1_F0R1			MMIO32(CAN1_BASE + 0x240)
/** CAN1_F0R2 Filter bank 0 register 2 **/
#define CAN1_F0R2			MMIO32(CAN1_BASE + 0x244)
/** CAN1_F1R1 Filter bank 1 register 1 **/
#define CAN1_F1R1			MMIO32(CAN1_BASE + 0x248)
/** CAN1_F1R2 Filter bank 1 register 2 **/
#define CAN1_F1R2			MMIO32(CAN1_BASE + 0x24c)
/** CAN1_F2R1 Filter bank 2 register 1 **/
#define CAN1_F2R1			MMIO32(CAN1_BASE + 0x250)
/** CAN1_F2R2 Filter bank 2 register 2 **/
#define CAN1_F2R2			MMIO32(CAN1_BASE + 0x254)
/** CAN1_F3R1 Filter bank 3 register 1 **/
#define CAN1_F3R1			MMIO32(CAN1_BASE + 0x258)
/** CAN1_F3R2 Filter bank 3 register 2 **/
#define CAN1_F3R2			MMIO32(CAN1_BASE + 0x25c)
/** CAN1_F4R1 Filter bank 4 register 1 **/
#define CAN1_F4R1			MMIO32(CAN1_BASE + 0x260)
/** CAN1_F4R2 Filter bank 4 register 2 **/
#define CAN1_F4R2			MMIO32(CAN1_BASE + 0x264)
/** CAN1_F5R1 Filter bank 5 register 1 **/
#define CAN1_F5R1			MMIO32(CAN1_BASE + 0x268)
/** CAN1_F5R2 Filter bank 5 register 2 **/
#define CAN1_F5R2			MMIO32(CAN1_BASE + 0x26c)
/** CAN1_F6R1 Filter bank 6 register 1 **/
#define CAN1_F6R1			MMIO32(CAN1_BASE + 0x270)
/** CAN1_F6R2 Filter bank 6 register 2 **/
#define CAN1_F6R2			MMIO32(CAN1_BASE + 0x274)
/** CAN1_F7R1 Filter bank 7 register 1 **/
#define CAN1_F7R1			MMIO32(CAN1_BASE + 0x278)
/** CAN1_F7R2 Filter bank 7 register 2 **/
#define CAN1_F7R2			MMIO32(CAN1_BASE + 0x27c)
/** CAN1_F8R1 Filter bank 8 register 1 **/
#define CAN1_F8R1			MMIO32(CAN1_BASE + 0x280)
/** CAN1_F8R2 Filter bank 8 register 2 **/
#define CAN1_F8R2			MMIO32(CAN1_BASE + 0x284)
/** CAN1_F9R1 Filter bank 9 register 1 **/
#define CAN1_F9R1			MMIO32(CAN1_BASE + 0x288)
/** CAN1_F9R2 Filter bank 9 register 2 **/
#define CAN1_F9R2			MMIO32(CAN1_BASE + 0x28c)
/** CAN1_F10R1 Filter bank 10 register 1 **/
#define CAN1_F10R1			MMIO32(CAN1_BASE + 0x290)
/** CAN1_F10R2 Filter bank 10 register 2 **/
#define CAN1_F10R2			MMIO32(CAN1_BASE + 0x294)
/** CAN1_F11R1 Filter bank 11 register 1 **/
#define CAN1_F11R1			MMIO32(CAN1_BASE + 0x298)
/** CAN1_F11R2 Filter bank 11 register 2 **/
#define CAN1_F11R2			MMIO32(CAN1_BASE + 0x29c)
/** CAN1_F12R1 Filter bank 4 register 1 **/
#define CAN1_F12R1			MMIO32(CAN1_BASE + 0x2a0)
/** CAN1_F12R2 Filter bank 12 register 2 **/
#define CAN1_F12R2			MMIO32(CAN1_BASE + 0x2a4)
/** CAN1_F13R1 Filter bank 13 register 1 **/
#define CAN1_F13R1			MMIO32(CAN1_BASE + 0x2a8)
/** CAN1_F13R2 Filter bank 13 register 2 **/
#define CAN1_F13R2			MMIO32(CAN1_BASE + 0x2ac)
/** CAN1_F14R1 Filter bank 14 register 1 **/
#define CAN1_F14R1			MMIO32(CAN1_BASE + 0x2b0)
/** CAN1_F14R2 Filter bank 14 register 2 **/
#define CAN1_F14R2			MMIO32(CAN1_BASE + 0x2b4)
/** CAN1_F15R1 Filter bank 15 register 1 **/
#define CAN1_F15R1			MMIO32(CAN1_BASE + 0x2b8)
/** CAN1_F15R2 Filter bank 15 register 2 **/
#define CAN1_F15R2			MMIO32(CAN1_BASE + 0x2bc)
/** CAN1_F16R1 Filter bank 16 register 1 **/
#define CAN1_F16R1			MMIO32(CAN1_BASE + 0x2c0)
/** CAN1_F16R2 Filter bank 16 register 2 **/
#define CAN1_F16R2			MMIO32(CAN1_BASE + 0x2c4)
/** CAN1_F17R1 Filter bank 17 register 1 **/
#define CAN1_F17R1			MMIO32(CAN1_BASE + 0x2c8)
/** CAN1_F17R2 Filter bank 17 register 2 **/
#define CAN1_F17R2			MMIO32(CAN1_BASE + 0x2cc)
/** CAN1_F18R1 Filter bank 18 register 1 **/
#define CAN1_F18R1			MMIO32(CAN1_BASE + 0x2d0)
/** CAN1_F18R2 Filter bank 18 register 2 **/
#define CAN1_F18R2			MMIO32(CAN1_BASE + 0x2d4)
/** CAN1_F19R1 Filter bank 19 register 1 **/
#define CAN1_F19R1			MMIO32(CAN1_BASE + 0x2d8)
/** CAN1_F19R2 Filter bank 19 register 2 **/
#define CAN1_F19R2			MMIO32(CAN1_BASE + 0x2dc)
/** CAN1_F20R1 Filter bank 20 register 1 **/
#define CAN1_F20R1			MMIO32(CAN1_BASE + 0x2e0)
/** CAN1_F20R2 Filter bank 20 register 2 **/
#define CAN1_F20R2			MMIO32(CAN1_BASE + 0x2e4)
/** CAN1_F21R1 Filter bank 21 register 1 **/
#define CAN1_F21R1			MMIO32(CAN1_BASE + 0x2e8)
/** CAN1_F21R2 Filter bank 21 register 2 **/
#define CAN1_F21R2			MMIO32(CAN1_BASE + 0x2ec)
/** CAN1_F22R1 Filter bank 22 register 1 **/
#define CAN1_F22R1			MMIO32(CAN1_BASE + 0x2f0)
/** CAN1_F22R2 Filter bank 22 register 2 **/
#define CAN1_F22R2			MMIO32(CAN1_BASE + 0x2f4)
/** CAN1_F23R1 Filter bank 23 register 1 **/
#define CAN1_F23R1			MMIO32(CAN1_BASE + 0x2f8)
/** CAN1_F23R2 Filter bank 23 register 2 **/
#define CAN1_F23R2			MMIO32(CAN1_BASE + 0x2fc)
/** CAN1_F24R1 Filter bank 24 register 1 **/
#define CAN1_F24R1			MMIO32(CAN1_BASE + 0x300)
/** CAN1_F24R2 Filter bank 24 register 2 **/
#define CAN1_F24R2			MMIO32(CAN1_BASE + 0x304)
/** CAN1_F25R1 Filter bank 25 register 1 **/
#define CAN1_F25R1			MMIO32(CAN1_BASE + 0x308)
/** CAN1_F25R2 Filter bank 25 register 2 **/
#define CAN1_F25R2			MMIO32(CAN1_BASE + 0x30c)
/** CAN1_F26R1 Filter bank 26 register 1 **/
#define CAN1_F26R1			MMIO32(CAN1_BASE + 0x310)
/** CAN1_F26R2 Filter bank 26 register 2 **/
#define CAN1_F26R2			MMIO32(CAN1_BASE + 0x314)
/** CAN1_F27R1 Filter bank 27 register 1 **/
#define CAN1_F27R1			MMIO32(CAN1_BASE + 0x318)
/** CAN1_F27R2 Filter bank 27 register 2 **/
#define CAN1_F27R2			MMIO32(CAN1_BASE + 0x31c)

/**@}*/


/** @defgroup can1_can_mcr CANMCR CAN_MCR
@{*/

/** CAN1_CAN_MCR_DBF DBF **/
#define CAN1_CAN_MCR_DBF		(1 << 16)
/** CAN1_CAN_MCR_RESET RESET **/
#define CAN1_CAN_MCR_RESET		(1 << 15)
/** CAN1_CAN_MCR_TTCM TTCM **/
#define CAN1_CAN_MCR_TTCM		(1 << 7)
/** CAN1_CAN_MCR_ABOM ABOM **/
#define CAN1_CAN_MCR_ABOM		(1 << 6)
/** CAN1_CAN_MCR_AWUM AWUM **/
#define CAN1_CAN_MCR_AWUM		(1 << 5)
/** CAN1_CAN_MCR_NART NART **/
#define CAN1_CAN_MCR_NART		(1 << 4)
/** CAN1_CAN_MCR_RFLM RFLM **/
#define CAN1_CAN_MCR_RFLM		(1 << 3)
/** CAN1_CAN_MCR_TXFP TXFP **/
#define CAN1_CAN_MCR_TXFP		(1 << 2)
/** CAN1_CAN_MCR_SLEEP SLEEP **/
#define CAN1_CAN_MCR_SLEEP		(1 << 1)
/** CAN1_CAN_MCR_INRQ INRQ **/
#define CAN1_CAN_MCR_INRQ		(1 << 0)

/**@}*/

/** @defgroup can1_can_msr CANMSR CAN_MSR
@{*/

/** CAN1_CAN_MSR_RX RX **/
#define CAN1_CAN_MSR_RX		(1 << 11)
/** CAN1_CAN_MSR_SAMP SAMP **/
#define CAN1_CAN_MSR_SAMP		(1 << 10)
/** CAN1_CAN_MSR_RXM RXM **/
#define CAN1_CAN_MSR_RXM		(1 << 9)
/** CAN1_CAN_MSR_TXM TXM **/
#define CAN1_CAN_MSR_TXM		(1 << 8)
/** CAN1_CAN_MSR_SLAKI SLAKI **/
#define CAN1_CAN_MSR_SLAKI		(1 << 4)
/** CAN1_CAN_MSR_WKUI WKUI **/
#define CAN1_CAN_MSR_WKUI		(1 << 3)
/** CAN1_CAN_MSR_ERRI ERRI **/
#define CAN1_CAN_MSR_ERRI		(1 << 2)
/** CAN1_CAN_MSR_SLAK SLAK **/
#define CAN1_CAN_MSR_SLAK		(1 << 1)
/** CAN1_CAN_MSR_INAK INAK **/
#define CAN1_CAN_MSR_INAK		(1 << 0)

/**@}*/

/** @defgroup can1_can_tsr CANTSR CAN_TSR
@{*/

/** CAN1_CAN_TSR_LOW2 Lowest priority flag for mailbox 2 **/
#define CAN1_CAN_TSR_LOW2		(1 << 31)
/** CAN1_CAN_TSR_LOW1 Lowest priority flag for mailbox 1 **/
#define CAN1_CAN_TSR_LOW1		(1 << 30)
/** CAN1_CAN_TSR_LOW0 Lowest priority flag for mailbox 0 **/
#define CAN1_CAN_TSR_LOW0		(1 << 29)
/** CAN1_CAN_TSR_TME2 Lowest priority flag for mailbox 2 **/
#define CAN1_CAN_TSR_TME2		(1 << 28)
/** CAN1_CAN_TSR_TME1 Lowest priority flag for mailbox 1 **/
#define CAN1_CAN_TSR_TME1		(1 << 27)
/** CAN1_CAN_TSR_TME0 Lowest priority flag for mailbox 0 **/
#define CAN1_CAN_TSR_TME0		(1 << 26)

#define CAN1_CAN_TSR_CODE_SHIFT		24
#define CAN1_CAN_TSR_CODE_MASK		0x03
/** @defgroup can1_can_tsr_code CODE CODE
@{*/
/**@}*/

/** CAN1_CAN_TSR_ABRQ2 ABRQ2 **/
#define CAN1_CAN_TSR_ABRQ2		(1 << 23)
/** CAN1_CAN_TSR_TERR2 TERR2 **/
#define CAN1_CAN_TSR_TERR2		(1 << 19)
/** CAN1_CAN_TSR_ALST2 ALST2 **/
#define CAN1_CAN_TSR_ALST2		(1 << 18)
/** CAN1_CAN_TSR_TXOK2 TXOK2 **/
#define CAN1_CAN_TSR_TXOK2		(1 << 17)
/** CAN1_CAN_TSR_RQCP2 RQCP2 **/
#define CAN1_CAN_TSR_RQCP2		(1 << 16)
/** CAN1_CAN_TSR_ABRQ1 ABRQ1 **/
#define CAN1_CAN_TSR_ABRQ1		(1 << 15)
/** CAN1_CAN_TSR_TERR1 TERR1 **/
#define CAN1_CAN_TSR_TERR1		(1 << 11)
/** CAN1_CAN_TSR_ALST1 ALST1 **/
#define CAN1_CAN_TSR_ALST1		(1 << 10)
/** CAN1_CAN_TSR_TXOK1 TXOK1 **/
#define CAN1_CAN_TSR_TXOK1		(1 << 9)
/** CAN1_CAN_TSR_RQCP1 RQCP1 **/
#define CAN1_CAN_TSR_RQCP1		(1 << 8)
/** CAN1_CAN_TSR_ABRQ0 ABRQ0 **/
#define CAN1_CAN_TSR_ABRQ0		(1 << 7)
/** CAN1_CAN_TSR_TERR0 TERR0 **/
#define CAN1_CAN_TSR_TERR0		(1 << 3)
/** CAN1_CAN_TSR_ALST0 ALST0 **/
#define CAN1_CAN_TSR_ALST0		(1 << 2)
/** CAN1_CAN_TSR_TXOK0 TXOK0 **/
#define CAN1_CAN_TSR_TXOK0		(1 << 1)
/** CAN1_CAN_TSR_RQCP0 RQCP0 **/
#define CAN1_CAN_TSR_RQCP0		(1 << 0)

/**@}*/

/** @defgroup can1_can_rf0r CANRF0R CAN_RF0R
@{*/

/** CAN1_CAN_RF0R_RFOM0 RFOM0 **/
#define CAN1_CAN_RF0R_RFOM0		(1 << 5)
/** CAN1_CAN_RF0R_FOVR0 FOVR0 **/
#define CAN1_CAN_RF0R_FOVR0		(1 << 4)
/** CAN1_CAN_RF0R_FULL0 FULL0 **/
#define CAN1_CAN_RF0R_FULL0		(1 << 3)

#define CAN1_CAN_RF0R_FMP0_SHIFT		0
#define CAN1_CAN_RF0R_FMP0_MASK		0x03
/** @defgroup can1_can_rf0r_fmp0 FMP0 FMP0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_rf1r CANRF1R CAN_RF1R
@{*/

/** CAN1_CAN_RF1R_RFOM1 RFOM1 **/
#define CAN1_CAN_RF1R_RFOM1		(1 << 5)
/** CAN1_CAN_RF1R_FOVR1 FOVR1 **/
#define CAN1_CAN_RF1R_FOVR1		(1 << 4)
/** CAN1_CAN_RF1R_FULL1 FULL1 **/
#define CAN1_CAN_RF1R_FULL1		(1 << 3)

#define CAN1_CAN_RF1R_FMP1_SHIFT		0
#define CAN1_CAN_RF1R_FMP1_MASK		0x03
/** @defgroup can1_can_rf1r_fmp1 FMP1 FMP1
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_ier CANIER CAN_IER
@{*/

/** CAN1_CAN_IER_SLKIE SLKIE **/
#define CAN1_CAN_IER_SLKIE		(1 << 17)
/** CAN1_CAN_IER_WKUIE WKUIE **/
#define CAN1_CAN_IER_WKUIE		(1 << 16)
/** CAN1_CAN_IER_ERRIE ERRIE **/
#define CAN1_CAN_IER_ERRIE		(1 << 15)
/** CAN1_CAN_IER_LECIE LECIE **/
#define CAN1_CAN_IER_LECIE		(1 << 11)
/** CAN1_CAN_IER_BOFIE BOFIE **/
#define CAN1_CAN_IER_BOFIE		(1 << 10)
/** CAN1_CAN_IER_EPVIE EPVIE **/
#define CAN1_CAN_IER_EPVIE		(1 << 9)
/** CAN1_CAN_IER_EWGIE EWGIE **/
#define CAN1_CAN_IER_EWGIE		(1 << 8)
/** CAN1_CAN_IER_FOVIE1 FOVIE1 **/
#define CAN1_CAN_IER_FOVIE1		(1 << 6)
/** CAN1_CAN_IER_FFIE1 FFIE1 **/
#define CAN1_CAN_IER_FFIE1		(1 << 5)
/** CAN1_CAN_IER_FMPIE1 FMPIE1 **/
#define CAN1_CAN_IER_FMPIE1		(1 << 4)
/** CAN1_CAN_IER_FOVIE0 FOVIE0 **/
#define CAN1_CAN_IER_FOVIE0		(1 << 3)
/** CAN1_CAN_IER_FFIE0 FFIE0 **/
#define CAN1_CAN_IER_FFIE0		(1 << 2)
/** CAN1_CAN_IER_FMPIE0 FMPIE0 **/
#define CAN1_CAN_IER_FMPIE0		(1 << 1)
/** CAN1_CAN_IER_TMEIE TMEIE **/
#define CAN1_CAN_IER_TMEIE		(1 << 0)

/**@}*/

/** @defgroup can1_can_esr CANESR CAN_ESR
@{*/


#define CAN1_CAN_ESR_REC_SHIFT		24
#define CAN1_CAN_ESR_REC_MASK		0xff
/** @defgroup can1_can_esr_rec REC REC
@{*/
/**@}*/


