grevaillot/svd_tools/headers/STM32F105xx/can1.h
#define CAN1_CAN_ESR_TEC_SHIFT		16
#define CAN1_CAN_ESR_TEC_MASK		0xff
/** @defgroup can1_can_esr_tec TEC TEC
@{*/
/**@}*/


#define CAN1_CAN_ESR_LEC_SHIFT		4
#define CAN1_CAN_ESR_LEC_MASK		0x07
/** @defgroup can1_can_esr_lec LEC LEC
@{*/
/**@}*/

/** CAN1_CAN_ESR_BOFF BOFF **/
#define CAN1_CAN_ESR_BOFF		(1 << 2)
/** CAN1_CAN_ESR_EPVF EPVF **/
#define CAN1_CAN_ESR_EPVF		(1 << 1)
/** CAN1_CAN_ESR_EWGF EWGF **/
#define CAN1_CAN_ESR_EWGF		(1 << 0)

/**@}*/

/** @defgroup can1_can_btr CANBTR CAN_BTR
@{*/

/** CAN1_CAN_BTR_SILM SILM **/
#define CAN1_CAN_BTR_SILM		(1 << 31)
/** CAN1_CAN_BTR_LBKM LBKM **/
#define CAN1_CAN_BTR_LBKM		(1 << 30)

#define CAN1_CAN_BTR_SJW_SHIFT		24
#define CAN1_CAN_BTR_SJW_MASK		0x03
/** @defgroup can1_can_btr_sjw SJW SJW
@{*/
/**@}*/


#define CAN1_CAN_BTR_TS2_SHIFT		20
#define CAN1_CAN_BTR_TS2_MASK		0x07
/** @defgroup can1_can_btr_ts2 TS2 TS2
@{*/
/**@}*/


#define CAN1_CAN_BTR_TS1_SHIFT		16
#define CAN1_CAN_BTR_TS1_MASK		0x0f
/** @defgroup can1_can_btr_ts1 TS1 TS1
@{*/
/**@}*/


#define CAN1_CAN_BTR_BRP_SHIFT		0
#define CAN1_CAN_BTR_BRP_MASK		0x3ff
/** @defgroup can1_can_btr_brp BRP BRP
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_ti0r CANTI0R CAN_TI0R
@{*/


#define CAN1_CAN_TI0R_STID_SHIFT		21
#define CAN1_CAN_TI0R_STID_MASK		0x7ff
/** @defgroup can1_can_ti0r_stid STID STID
@{*/
/**@}*/


#define CAN1_CAN_TI0R_EXID_SHIFT		3
#define CAN1_CAN_TI0R_EXID_MASK		0x3ffff
/** @defgroup can1_can_ti0r_exid EXID EXID
@{*/
/**@}*/

/** CAN1_CAN_TI0R_IDE IDE **/
#define CAN1_CAN_TI0R_IDE		(1 << 2)
/** CAN1_CAN_TI0R_RTR RTR **/
#define CAN1_CAN_TI0R_RTR		(1 << 1)
/** CAN1_CAN_TI0R_TXRQ TXRQ **/
#define CAN1_CAN_TI0R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can1_can_tdt0r CANTDT0R CAN_TDT0R
@{*/


#define CAN1_CAN_TDT0R_TIME_SHIFT		16
#define CAN1_CAN_TDT0R_TIME_MASK		0xffff
/** @defgroup can1_can_tdt0r_time TIME TIME
@{*/
/**@}*/

/** CAN1_CAN_TDT0R_TGT TGT **/
#define CAN1_CAN_TDT0R_TGT		(1 << 8)

#define CAN1_CAN_TDT0R_DLC_SHIFT		0
#define CAN1_CAN_TDT0R_DLC_MASK		0x0f
/** @defgroup can1_can_tdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_tdl0r CANTDL0R CAN_TDL0R
@{*/


#define CAN1_CAN_TDL0R_DATA3_SHIFT		24
#define CAN1_CAN_TDL0R_DATA3_MASK		0xff
/** @defgroup can1_can_tdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN1_CAN_TDL0R_DATA2_SHIFT		16
#define CAN1_CAN_TDL0R_DATA2_MASK		0xff
/** @defgroup can1_can_tdl0r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN1_CAN_TDL0R_DATA1_SHIFT		8
#define CAN1_CAN_TDL0R_DATA1_MASK		0xff
/** @defgroup can1_can_tdl0r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN1_CAN_TDL0R_DATA0_SHIFT		0
#define CAN1_CAN_TDL0R_DATA0_MASK		0xff
/** @defgroup can1_can_tdl0r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_tdh0r CANTDH0R CAN_TDH0R
@{*/


#define CAN1_CAN_TDH0R_DATA7_SHIFT		24
#define CAN1_CAN_TDH0R_DATA7_MASK		0xff
/** @defgroup can1_can_tdh0r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN1_CAN_TDH0R_DATA6_SHIFT		16
#define CAN1_CAN_TDH0R_DATA6_MASK		0xff
/** @defgroup can1_can_tdh0r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN1_CAN_TDH0R_DATA5_SHIFT		8
#define CAN1_CAN_TDH0R_DATA5_MASK		0xff
/** @defgroup can1_can_tdh0r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN1_CAN_TDH0R_DATA4_SHIFT		0
#define CAN1_CAN_TDH0R_DATA4_MASK		0xff
/** @defgroup can1_can_tdh0r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_ti1r CANTI1R CAN_TI1R
@{*/


#define CAN1_CAN_TI1R_STID_SHIFT		21
#define CAN1_CAN_TI1R_STID_MASK		0x7ff
/** @defgroup can1_can_ti1r_stid STID STID
@{*/
/**@}*/


#define CAN1_CAN_TI1R_EXID_SHIFT		3
#define CAN1_CAN_TI1R_EXID_MASK		0x3ffff
/** @defgroup can1_can_ti1r_exid EXID EXID
@{*/
/**@}*/

/** CAN1_CAN_TI1R_IDE IDE **/
#define CAN1_CAN_TI1R_IDE		(1 << 2)
/** CAN1_CAN_TI1R_RTR RTR **/
#define CAN1_CAN_TI1R_RTR		(1 << 1)
/** CAN1_CAN_TI1R_TXRQ TXRQ **/
#define CAN1_CAN_TI1R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can1_can_tdt1r CANTDT1R CAN_TDT1R
@{*/


#define CAN1_CAN_TDT1R_TIME_SHIFT		16
#define CAN1_CAN_TDT1R_TIME_MASK		0xffff
/** @defgroup can1_can_tdt1r_time TIME TIME
@{*/
/**@}*/

/** CAN1_CAN_TDT1R_TGT TGT **/
#define CAN1_CAN_TDT1R_TGT		(1 << 8)

#define CAN1_CAN_TDT1R_DLC_SHIFT		0
#define CAN1_CAN_TDT1R_DLC_MASK		0x0f
/** @defgroup can1_can_tdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_tdl1r CANTDL1R CAN_TDL1R
@{*/


#define CAN1_CAN_TDL1R_DATA3_SHIFT		24
#define CAN1_CAN_TDL1R_DATA3_MASK		0xff
/** @defgroup can1_can_tdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN1_CAN_TDL1R_DATA2_SHIFT		16
#define CAN1_CAN_TDL1R_DATA2_MASK		0xff
/** @defgroup can1_can_tdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN1_CAN_TDL1R_DATA1_SHIFT		8
#define CAN1_CAN_TDL1R_DATA1_MASK		0xff
/** @defgroup can1_can_tdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN1_CAN_TDL1R_DATA0_SHIFT		0
#define CAN1_CAN_TDL1R_DATA0_MASK		0xff
/** @defgroup can1_can_tdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_tdh1r CANTDH1R CAN_TDH1R
@{*/


#define CAN1_CAN_TDH1R_DATA7_SHIFT		24
#define CAN1_CAN_TDH1R_DATA7_MASK		0xff
/** @defgroup can1_can_tdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN1_CAN_TDH1R_DATA6_SHIFT		16
#define CAN1_CAN_TDH1R_DATA6_MASK		0xff
/** @defgroup can1_can_tdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN1_CAN_TDH1R_DATA5_SHIFT		8
#define CAN1_CAN_TDH1R_DATA5_MASK		0xff
/** @defgroup can1_can_tdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN1_CAN_TDH1R_DATA4_SHIFT		0
#define CAN1_CAN_TDH1R_DATA4_MASK		0xff
/** @defgroup can1_can_tdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_ti2r CANTI2R CAN_TI2R
@{*/


#define CAN1_CAN_TI2R_STID_SHIFT		21
#define CAN1_CAN_TI2R_STID_MASK		0x7ff
/** @defgroup can1_can_ti2r_stid STID STID
@{*/
/**@}*/


#define CAN1_CAN_TI2R_EXID_SHIFT		3
#define CAN1_CAN_TI2R_EXID_MASK		0x3ffff
/** @defgroup can1_can_ti2r_exid EXID EXID
@{*/
/**@}*/

/** CAN1_CAN_TI2R_IDE IDE **/
#define CAN1_CAN_TI2R_IDE		(1 << 2)
/** CAN1_CAN_TI2R_RTR RTR **/
#define CAN1_CAN_TI2R_RTR		(1 << 1)
/** CAN1_CAN_TI2R_TXRQ TXRQ **/
#define CAN1_CAN_TI2R_TXRQ		(1 << 0)

/**@}*/

