grevaillot/svd_tools/headers/STM32F105xx/can1.h
/** @defgroup can1_can_tdt2r CANTDT2R CAN_TDT2R
@{*/


#define CAN1_CAN_TDT2R_TIME_SHIFT		16
#define CAN1_CAN_TDT2R_TIME_MASK		0xffff
/** @defgroup can1_can_tdt2r_time TIME TIME
@{*/
/**@}*/

/** CAN1_CAN_TDT2R_TGT TGT **/
#define CAN1_CAN_TDT2R_TGT		(1 << 8)

#define CAN1_CAN_TDT2R_DLC_SHIFT		0
#define CAN1_CAN_TDT2R_DLC_MASK		0x0f
/** @defgroup can1_can_tdt2r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_tdl2r CANTDL2R CAN_TDL2R
@{*/


#define CAN1_CAN_TDL2R_DATA3_SHIFT		24
#define CAN1_CAN_TDL2R_DATA3_MASK		0xff
/** @defgroup can1_can_tdl2r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN1_CAN_TDL2R_DATA2_SHIFT		16
#define CAN1_CAN_TDL2R_DATA2_MASK		0xff
/** @defgroup can1_can_tdl2r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN1_CAN_TDL2R_DATA1_SHIFT		8
#define CAN1_CAN_TDL2R_DATA1_MASK		0xff
/** @defgroup can1_can_tdl2r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN1_CAN_TDL2R_DATA0_SHIFT		0
#define CAN1_CAN_TDL2R_DATA0_MASK		0xff
/** @defgroup can1_can_tdl2r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_tdh2r CANTDH2R CAN_TDH2R
@{*/


#define CAN1_CAN_TDH2R_DATA7_SHIFT		24
#define CAN1_CAN_TDH2R_DATA7_MASK		0xff
/** @defgroup can1_can_tdh2r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN1_CAN_TDH2R_DATA6_SHIFT		16
#define CAN1_CAN_TDH2R_DATA6_MASK		0xff
/** @defgroup can1_can_tdh2r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN1_CAN_TDH2R_DATA5_SHIFT		8
#define CAN1_CAN_TDH2R_DATA5_MASK		0xff
/** @defgroup can1_can_tdh2r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN1_CAN_TDH2R_DATA4_SHIFT		0
#define CAN1_CAN_TDH2R_DATA4_MASK		0xff
/** @defgroup can1_can_tdh2r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_ri0r CANRI0R CAN_RI0R
@{*/


#define CAN1_CAN_RI0R_STID_SHIFT		21
#define CAN1_CAN_RI0R_STID_MASK		0x7ff
/** @defgroup can1_can_ri0r_stid STID STID
@{*/
/**@}*/


#define CAN1_CAN_RI0R_EXID_SHIFT		3
#define CAN1_CAN_RI0R_EXID_MASK		0x3ffff
/** @defgroup can1_can_ri0r_exid EXID EXID
@{*/
/**@}*/

/** CAN1_CAN_RI0R_IDE IDE **/
#define CAN1_CAN_RI0R_IDE		(1 << 2)
/** CAN1_CAN_RI0R_RTR RTR **/
#define CAN1_CAN_RI0R_RTR		(1 << 1)

/**@}*/

/** @defgroup can1_can_rdt0r CANRDT0R CAN_RDT0R
@{*/


#define CAN1_CAN_RDT0R_TIME_SHIFT		16
#define CAN1_CAN_RDT0R_TIME_MASK		0xffff
/** @defgroup can1_can_rdt0r_time TIME TIME
@{*/
/**@}*/


#define CAN1_CAN_RDT0R_FMI_SHIFT		8
#define CAN1_CAN_RDT0R_FMI_MASK		0xff
/** @defgroup can1_can_rdt0r_fmi FMI FMI
@{*/
/**@}*/


#define CAN1_CAN_RDT0R_DLC_SHIFT		0
#define CAN1_CAN_RDT0R_DLC_MASK		0x0f
/** @defgroup can1_can_rdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_rdl0r CANRDL0R CAN_RDL0R
@{*/


#define CAN1_CAN_RDL0R_DATA3_SHIFT		24
#define CAN1_CAN_RDL0R_DATA3_MASK		0xff
/** @defgroup can1_can_rdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN1_CAN_RDL0R_DATA2_SHIFT		16
#define CAN1_CAN_RDL0R_DATA2_MASK		0xff
/** @defgroup can1_can_rdl0r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN1_CAN_RDL0R_DATA1_SHIFT		8
#define CAN1_CAN_RDL0R_DATA1_MASK		0xff
/** @defgroup can1_can_rdl0r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN1_CAN_RDL0R_DATA0_SHIFT		0
#define CAN1_CAN_RDL0R_DATA0_MASK		0xff
/** @defgroup can1_can_rdl0r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_rdh0r CANRDH0R CAN_RDH0R
@{*/


#define CAN1_CAN_RDH0R_DATA7_SHIFT		24
#define CAN1_CAN_RDH0R_DATA7_MASK		0xff
/** @defgroup can1_can_rdh0r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN1_CAN_RDH0R_DATA6_SHIFT		16
#define CAN1_CAN_RDH0R_DATA6_MASK		0xff
/** @defgroup can1_can_rdh0r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN1_CAN_RDH0R_DATA5_SHIFT		8
#define CAN1_CAN_RDH0R_DATA5_MASK		0xff
/** @defgroup can1_can_rdh0r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN1_CAN_RDH0R_DATA4_SHIFT		0
#define CAN1_CAN_RDH0R_DATA4_MASK		0xff
/** @defgroup can1_can_rdh0r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_ri1r CANRI1R CAN_RI1R
@{*/


#define CAN1_CAN_RI1R_STID_SHIFT		21
#define CAN1_CAN_RI1R_STID_MASK		0x7ff
/** @defgroup can1_can_ri1r_stid STID STID
@{*/
/**@}*/


#define CAN1_CAN_RI1R_EXID_SHIFT		3
#define CAN1_CAN_RI1R_EXID_MASK		0x3ffff
/** @defgroup can1_can_ri1r_exid EXID EXID
@{*/
/**@}*/

/** CAN1_CAN_RI1R_IDE IDE **/
#define CAN1_CAN_RI1R_IDE		(1 << 2)
/** CAN1_CAN_RI1R_RTR RTR **/
#define CAN1_CAN_RI1R_RTR		(1 << 1)

/**@}*/

/** @defgroup can1_can_rdt1r CANRDT1R CAN_RDT1R
@{*/


#define CAN1_CAN_RDT1R_TIME_SHIFT		16
#define CAN1_CAN_RDT1R_TIME_MASK		0xffff
/** @defgroup can1_can_rdt1r_time TIME TIME
@{*/
/**@}*/


#define CAN1_CAN_RDT1R_FMI_SHIFT		8
#define CAN1_CAN_RDT1R_FMI_MASK		0xff
/** @defgroup can1_can_rdt1r_fmi FMI FMI
@{*/
/**@}*/


#define CAN1_CAN_RDT1R_DLC_SHIFT		0
#define CAN1_CAN_RDT1R_DLC_MASK		0x0f
/** @defgroup can1_can_rdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_rdl1r CANRDL1R CAN_RDL1R
@{*/


#define CAN1_CAN_RDL1R_DATA3_SHIFT		24
#define CAN1_CAN_RDL1R_DATA3_MASK		0xff
/** @defgroup can1_can_rdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN1_CAN_RDL1R_DATA2_SHIFT		16
#define CAN1_CAN_RDL1R_DATA2_MASK		0xff
/** @defgroup can1_can_rdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN1_CAN_RDL1R_DATA1_SHIFT		8
#define CAN1_CAN_RDL1R_DATA1_MASK		0xff
/** @defgroup can1_can_rdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN1_CAN_RDL1R_DATA0_SHIFT		0
#define CAN1_CAN_RDL1R_DATA0_MASK		0xff
/** @defgroup can1_can_rdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_rdh1r CANRDH1R CAN_RDH1R
@{*/


#define CAN1_CAN_RDH1R_DATA7_SHIFT		24
#define CAN1_CAN_RDH1R_DATA7_MASK		0xff
/** @defgroup can1_can_rdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN1_CAN_RDH1R_DATA6_SHIFT		16
#define CAN1_CAN_RDH1R_DATA6_MASK		0xff
/** @defgroup can1_can_rdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN1_CAN_RDH1R_DATA5_SHIFT		8
#define CAN1_CAN_RDH1R_DATA5_MASK		0xff
/** @defgroup can1_can_rdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN1_CAN_RDH1R_DATA4_SHIFT		0
#define CAN1_CAN_RDH1R_DATA4_MASK		0xff
/** @defgroup can1_can_rdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can1_can_fmr CANFMR CAN_FMR
@{*/


#define CAN1_CAN_FMR_CAN2SB_SHIFT		8
#define CAN1_CAN_FMR_CAN2SB_MASK		0x3f
/** @defgroup can1_can_fmr_can2sb CAN2SB CAN2SB
@{*/
/**@}*/

/** CAN1_CAN_FMR_FINIT FINIT **/
#define CAN1_CAN_FMR_FINIT		(1 << 0)

/**@}*/

/** @defgroup can1_can_fm1r CANFM1R CAN_FM1R
@{*/

