grevaillot/svd_tools/headers/STM32F105xx/can1.h
/** CAN1_CAN_FM1R_FBM27 Filter mode **/
#define CAN1_CAN_FM1R_FBM27		(1 << 27)
/** CAN1_CAN_FM1R_FBM26 Filter mode **/
#define CAN1_CAN_FM1R_FBM26		(1 << 26)
/** CAN1_CAN_FM1R_FBM25 Filter mode **/
#define CAN1_CAN_FM1R_FBM25		(1 << 25)
/** CAN1_CAN_FM1R_FBM24 Filter mode **/
#define CAN1_CAN_FM1R_FBM24		(1 << 24)
/** CAN1_CAN_FM1R_FBM23 Filter mode **/
#define CAN1_CAN_FM1R_FBM23		(1 << 23)
/** CAN1_CAN_FM1R_FBM22 Filter mode **/
#define CAN1_CAN_FM1R_FBM22		(1 << 22)
/** CAN1_CAN_FM1R_FBM21 Filter mode **/
#define CAN1_CAN_FM1R_FBM21		(1 << 21)
/** CAN1_CAN_FM1R_FBM20 Filter mode **/
#define CAN1_CAN_FM1R_FBM20		(1 << 20)
/** CAN1_CAN_FM1R_FBM19 Filter mode **/
#define CAN1_CAN_FM1R_FBM19		(1 << 19)
/** CAN1_CAN_FM1R_FBM18 Filter mode **/
#define CAN1_CAN_FM1R_FBM18		(1 << 18)
/** CAN1_CAN_FM1R_FBM17 Filter mode **/
#define CAN1_CAN_FM1R_FBM17		(1 << 17)
/** CAN1_CAN_FM1R_FBM16 Filter mode **/
#define CAN1_CAN_FM1R_FBM16		(1 << 16)
/** CAN1_CAN_FM1R_FBM15 Filter mode **/
#define CAN1_CAN_FM1R_FBM15		(1 << 15)
/** CAN1_CAN_FM1R_FBM14 Filter mode **/
#define CAN1_CAN_FM1R_FBM14		(1 << 14)
/** CAN1_CAN_FM1R_FBM13 Filter mode **/
#define CAN1_CAN_FM1R_FBM13		(1 << 13)
/** CAN1_CAN_FM1R_FBM12 Filter mode **/
#define CAN1_CAN_FM1R_FBM12		(1 << 12)
/** CAN1_CAN_FM1R_FBM11 Filter mode **/
#define CAN1_CAN_FM1R_FBM11		(1 << 11)
/** CAN1_CAN_FM1R_FBM10 Filter mode **/
#define CAN1_CAN_FM1R_FBM10		(1 << 10)
/** CAN1_CAN_FM1R_FBM9 Filter mode **/
#define CAN1_CAN_FM1R_FBM9		(1 << 9)
/** CAN1_CAN_FM1R_FBM8 Filter mode **/
#define CAN1_CAN_FM1R_FBM8		(1 << 8)
/** CAN1_CAN_FM1R_FBM7 Filter mode **/
#define CAN1_CAN_FM1R_FBM7		(1 << 7)
/** CAN1_CAN_FM1R_FBM6 Filter mode **/
#define CAN1_CAN_FM1R_FBM6		(1 << 6)
/** CAN1_CAN_FM1R_FBM5 Filter mode **/
#define CAN1_CAN_FM1R_FBM5		(1 << 5)
/** CAN1_CAN_FM1R_FBM4 Filter mode **/
#define CAN1_CAN_FM1R_FBM4		(1 << 4)
/** CAN1_CAN_FM1R_FBM3 Filter mode **/
#define CAN1_CAN_FM1R_FBM3		(1 << 3)
/** CAN1_CAN_FM1R_FBM2 Filter mode **/
#define CAN1_CAN_FM1R_FBM2		(1 << 2)
/** CAN1_CAN_FM1R_FBM1 Filter mode **/
#define CAN1_CAN_FM1R_FBM1		(1 << 1)
/** CAN1_CAN_FM1R_FBM0 Filter mode **/
#define CAN1_CAN_FM1R_FBM0		(1 << 0)

/**@}*/

/** @defgroup can1_can_fs1r CANFS1R CAN_FS1R
@{*/

/** CAN1_CAN_FS1R_FSC27 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC27		(1 << 27)
/** CAN1_CAN_FS1R_FSC26 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC26		(1 << 26)
/** CAN1_CAN_FS1R_FSC25 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC25		(1 << 25)
/** CAN1_CAN_FS1R_FSC24 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC24		(1 << 24)
/** CAN1_CAN_FS1R_FSC23 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC23		(1 << 23)
/** CAN1_CAN_FS1R_FSC22 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC22		(1 << 22)
/** CAN1_CAN_FS1R_FSC21 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC21		(1 << 21)
/** CAN1_CAN_FS1R_FSC20 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC20		(1 << 20)
/** CAN1_CAN_FS1R_FSC19 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC19		(1 << 19)
/** CAN1_CAN_FS1R_FSC18 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC18		(1 << 18)
/** CAN1_CAN_FS1R_FSC17 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC17		(1 << 17)
/** CAN1_CAN_FS1R_FSC16 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC16		(1 << 16)
/** CAN1_CAN_FS1R_FSC15 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC15		(1 << 15)
/** CAN1_CAN_FS1R_FSC14 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC14		(1 << 14)
/** CAN1_CAN_FS1R_FSC13 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC13		(1 << 13)
/** CAN1_CAN_FS1R_FSC12 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC12		(1 << 12)
/** CAN1_CAN_FS1R_FSC11 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC11		(1 << 11)
/** CAN1_CAN_FS1R_FSC10 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC10		(1 << 10)
/** CAN1_CAN_FS1R_FSC9 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC9		(1 << 9)
/** CAN1_CAN_FS1R_FSC8 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC8		(1 << 8)
/** CAN1_CAN_FS1R_FSC7 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC7		(1 << 7)
/** CAN1_CAN_FS1R_FSC6 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC6		(1 << 6)
/** CAN1_CAN_FS1R_FSC5 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC5		(1 << 5)
/** CAN1_CAN_FS1R_FSC4 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC4		(1 << 4)
/** CAN1_CAN_FS1R_FSC3 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC3		(1 << 3)
/** CAN1_CAN_FS1R_FSC2 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC2		(1 << 2)
/** CAN1_CAN_FS1R_FSC1 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC1		(1 << 1)
/** CAN1_CAN_FS1R_FSC0 Filter scale configuration **/
#define CAN1_CAN_FS1R_FSC0		(1 << 0)

/**@}*/

/** @defgroup can1_can_ffa1r CANFFA1R CAN_FFA1R
@{*/

/** CAN1_CAN_FFA1R_FFA27 Filter FIFO assignment for filter 27 **/
#define CAN1_CAN_FFA1R_FFA27		(1 << 27)
/** CAN1_CAN_FFA1R_FFA26 Filter FIFO assignment for filter 26 **/
#define CAN1_CAN_FFA1R_FFA26		(1 << 26)
/** CAN1_CAN_FFA1R_FFA25 Filter FIFO assignment for filter 25 **/
#define CAN1_CAN_FFA1R_FFA25		(1 << 25)
/** CAN1_CAN_FFA1R_FFA24 Filter FIFO assignment for filter 24 **/
#define CAN1_CAN_FFA1R_FFA24		(1 << 24)
/** CAN1_CAN_FFA1R_FFA23 Filter FIFO assignment for filter 23 **/
#define CAN1_CAN_FFA1R_FFA23		(1 << 23)
/** CAN1_CAN_FFA1R_FFA22 Filter FIFO assignment for filter 22 **/
#define CAN1_CAN_FFA1R_FFA22		(1 << 22)
/** CAN1_CAN_FFA1R_FFA21 Filter FIFO assignment for filter 21 **/
#define CAN1_CAN_FFA1R_FFA21		(1 << 21)
/** CAN1_CAN_FFA1R_FFA20 Filter FIFO assignment for filter 20 **/
#define CAN1_CAN_FFA1R_FFA20		(1 << 20)
/** CAN1_CAN_FFA1R_FFA19 Filter FIFO assignment for filter 19 **/
#define CAN1_CAN_FFA1R_FFA19		(1 << 19)
/** CAN1_CAN_FFA1R_FFA18 Filter FIFO assignment for filter 18 **/
#define CAN1_CAN_FFA1R_FFA18		(1 << 18)
/** CAN1_CAN_FFA1R_FFA17 Filter FIFO assignment for filter 17 **/
#define CAN1_CAN_FFA1R_FFA17		(1 << 17)
/** CAN1_CAN_FFA1R_FFA16 Filter FIFO assignment for filter 16 **/
#define CAN1_CAN_FFA1R_FFA16		(1 << 16)
/** CAN1_CAN_FFA1R_FFA15 Filter FIFO assignment for filter 15 **/
#define CAN1_CAN_FFA1R_FFA15		(1 << 15)
/** CAN1_CAN_FFA1R_FFA14 Filter FIFO assignment for filter 14 **/
#define CAN1_CAN_FFA1R_FFA14		(1 << 14)
/** CAN1_CAN_FFA1R_FFA13 Filter FIFO assignment for filter 13 **/
#define CAN1_CAN_FFA1R_FFA13		(1 << 13)
/** CAN1_CAN_FFA1R_FFA12 Filter FIFO assignment for filter 12 **/
#define CAN1_CAN_FFA1R_FFA12		(1 << 12)
/** CAN1_CAN_FFA1R_FFA11 Filter FIFO assignment for filter 11 **/
#define CAN1_CAN_FFA1R_FFA11		(1 << 11)
/** CAN1_CAN_FFA1R_FFA10 Filter FIFO assignment for filter 10 **/
#define CAN1_CAN_FFA1R_FFA10		(1 << 10)
/** CAN1_CAN_FFA1R_FFA9 Filter FIFO assignment for filter 9 **/
#define CAN1_CAN_FFA1R_FFA9		(1 << 9)
/** CAN1_CAN_FFA1R_FFA8 Filter FIFO assignment for filter 8 **/
#define CAN1_CAN_FFA1R_FFA8		(1 << 8)
/** CAN1_CAN_FFA1R_FFA7 Filter FIFO assignment for filter 7 **/
#define CAN1_CAN_FFA1R_FFA7		(1 << 7)
/** CAN1_CAN_FFA1R_FFA6 Filter FIFO assignment for filter 6 **/
#define CAN1_CAN_FFA1R_FFA6		(1 << 6)
/** CAN1_CAN_FFA1R_FFA5 Filter FIFO assignment for filter 5 **/
#define CAN1_CAN_FFA1R_FFA5		(1 << 5)
/** CAN1_CAN_FFA1R_FFA4 Filter FIFO assignment for filter 4 **/
#define CAN1_CAN_FFA1R_FFA4		(1 << 4)
/** CAN1_CAN_FFA1R_FFA3 Filter FIFO assignment for filter 3 **/
#define CAN1_CAN_FFA1R_FFA3		(1 << 3)
/** CAN1_CAN_FFA1R_FFA2 Filter FIFO assignment for filter 2 **/
#define CAN1_CAN_FFA1R_FFA2		(1 << 2)
/** CAN1_CAN_FFA1R_FFA1 Filter FIFO assignment for filter 1 **/
#define CAN1_CAN_FFA1R_FFA1		(1 << 1)
/** CAN1_CAN_FFA1R_FFA0 Filter FIFO assignment for filter 0 **/
#define CAN1_CAN_FFA1R_FFA0		(1 << 0)

/**@}*/

